In [2]:
import pandas as pd

In [3]:
ex3= {
    'id':[1,2,3,4],
    'nome':['ana','pedro','maria','joão'],
    'setores':['rh','vebdas','administrativo','produção']
}

In [4]:
ex3_2= {
    'id':[1,2,3,4],
    'salarios':[3000,2800,3200,2500]
}

In [5]:
df1=pd.DataFrame(ex3)

In [6]:
df1.head()

   id   nome         setores
0   1    ana              rh
1   2  pedro          vebdas
2   3  maria  administrativo
3   4   joão        produção

In [7]:
df2=pd.DataFrame(ex3_2)

In [8]:
df2.head()

   id  salarios
0   1      3000
1   2      2800
2   3      3200
3   4      2500

In [10]:
df_n =pd.merge(df1,df2,how='inner',on='id')

In [11]:
df_n.head()

   id   nome         setores  salarios
0   1    ana              rh      3000
1   2  pedro          vebdas      2800
2   3  maria  administrativo      3200
3   4   joão        produção      2500